[Killed] BooleanLiteral
roberto/teste-cit/src/App.js:13:62
 import { Container, GlobalStyle } from "./styles";
 
 function App() {
-  const [openModalSchedule, setOpenModalSchedule] = useState(false);
+  const [openModalSchedule, setOpenModalSchedule] = useState(true);
 
   const [scheduleForm, setScheduleForm] = useState();

[Survived] BlockStatement
roberto/teste-cit/src/App.js:19:19
 
   const { schedules, handleSaveSchedule } = useSchedules();
 
-  useEffect(() => {
-    if (!openModalSchedule) {
-      setScheduleForm();
-    }
-  }, [openModalSchedule]);
+  useEffect(() => {}, [openModalSchedule]);
 
   const handleDateClick = useCallback(({ dateStr }) => {

[Survived] BlockStatement
roberto/teste-cit/src/App.js:20:29
   const { schedules, handleSaveSchedule } = useSchedules();
 
   useEffect(() => {
-    if (!openModalSchedule) {
-      setScheduleForm();
-    }
+    if (!openModalSchedule) {}
   }, [openModalSchedule]);
 

[Survived] BooleanLiteral
roberto/teste-cit/src/App.js:20:9
   const { schedules, handleSaveSchedule } = useSchedules();
 
   useEffect(() => {
-    if (!openModalSchedule) {
+    if (openModalSchedule) {
       setScheduleForm();
     }

[Survived] BlockStatement
roberto/teste-cit/src/App.js:25:56
     }
   }, [openModalSchedule]);
 
-  const handleDateClick = useCallback(({ dateStr }) => {
-    setScheduleForm({ start: moment(dateStr).format("YYYY-MM-DDTHH:mm") });
-    setOpenModalSchedule(true);
-  }, []);
+  const handleDateClick = useCallback(({ dateStr }) => {}, []);
 
   const handleEventClick = useCallback(

[Survived] BooleanLiteral
roberto/teste-cit/src/App.js:27:26
 
   const handleDateClick = useCallback(({ dateStr }) => {
     setScheduleForm({ start: moment(dateStr).format("YYYY-MM-DDTHH:mm") });
-    setOpenModalSchedule(true);
+    setOpenModalSchedule(false);
   }, []);
 

[Survived] BlockStatement
roberto/teste-cit/src/App.js:31:20
   }, []);
 
   const handleEventClick = useCallback(
-    ({ event }) => {
-      const schedule = schedules.find((item) => item.id === Number(event.id));
-
-      setScheduleForm(schedule);
-      setOpenModalSchedule(true);
-    },
+    ({ event }) => {},
     [schedules]
   );

[Survived] ArrowFunction
roberto/teste-cit/src/App.js:32:39
 
   const handleEventClick = useCallback(
     ({ event }) => {
-      const schedule = schedules.find((item) => item.id === Number(event.id));
+      const schedule = schedules.find(() => undefined);
 
       setScheduleForm(schedule);

[Survived] EqualityOperator
roberto/teste-cit/src/App.js:32:49
 
   const handleEventClick = useCallback(
     ({ event }) => {
-      const schedule = schedules.find((item) => item.id === Number(event.id));
+      const schedule = schedules.find((item) => item.id !== Number(event.id));
 
       setScheduleForm(schedule);

[Survived] BooleanLiteral
roberto/teste-cit/src/App.js:35:28
       const schedule = schedules.find((item) => item.id === Number(event.id));
 
       setScheduleForm(schedule);
-      setOpenModalSchedule(true);
+      setOpenModalSchedule(false);
     },
     [schedules]

[Survived] ArrayDeclaration
roberto/teste-cit/src/App.js:37:5
       setScheduleForm(schedule);
       setOpenModalSchedule(true);
     },
-    [schedules]
+    []
   );
 

[Survived] BlockStatement
roberto/teste-cit/src/App.js:40:32
     [schedules]
   );
 
-  const events = useMemo(() => {
-    return schedules.map((schedule) => ({
-      id: schedule.id,
-      title: schedule.title,
-      date: moment(schedule.start).format("YYYY-MM-DDTHH:mm"),
-      end: moment(schedule.end).format("YYYY-MM-DDTHH:mm"),
-    }));
-  }, [schedules]);
+  const events = useMemo(() => {}, [schedules]);
 
   return (

[Survived] ArrowFunction
roberto/teste-cit/src/App.js:41:26
   );
 
   const events = useMemo(() => {
-    return schedules.map((schedule) => ({
-      id: schedule.id,
-      title: schedule.title,
-      date: moment(schedule.start).format("YYYY-MM-DDTHH:mm"),
-      end: moment(schedule.end).format("YYYY-MM-DDTHH:mm"),
-    }));
+    return schedules.map(() => undefined);
   }, [schedules]);
 

[Survived] ObjectLiteral
roberto/teste-cit/src/App.js:41:41
   );
 
   const events = useMemo(() => {
-    return schedules.map((schedule) => ({
-      id: schedule.id,
-      title: schedule.title,
-      date: moment(schedule.start).format("YYYY-MM-DDTHH:mm"),
-      end: moment(schedule.end).format("YYYY-MM-DDTHH:mm"),
-    }));
+    return schedules.map((schedule) => ({}));
   }, [schedules]);
 

[Survived] StringLiteral
roberto/teste-cit/src/App.js:44:43
     return schedules.map((schedule) => ({
       id: schedule.id,
       title: schedule.title,
-      date: moment(schedule.start).format("YYYY-MM-DDTHH:mm"),
+      date: moment(schedule.start).format(""),
       end: moment(schedule.end).format("YYYY-MM-DDTHH:mm"),
     }));

[Survived] BlockStatement
roberto/teste-cit/src/App.js:56:25
       <ModalSchedule
         open={openModalSchedule}
         value={scheduleForm}
-        onCancel={() => {
-          setOpenModalSchedule(false);
-        }}
+        onCancel={() => {}}
         onSave={(schedule) => {
           handleSaveSchedule(schedule);

[Survived] BooleanLiteral
roberto/teste-cit/src/App.js:57:32
         open={openModalSchedule}
         value={scheduleForm}
         onCancel={() => {
-          setOpenModalSchedule(false);
+          setOpenModalSchedule(true);
         }}
         onSave={(schedule) => {

[Survived] BlockStatement
roberto/teste-cit/src/App.js:59:31
         onCancel={() => {
           setOpenModalSchedule(false);
         }}
-        onSave={(schedule) => {
-          handleSaveSchedule(schedule);
-          setOpenModalSchedule(false);
-        }}
+        onSave={(schedule) => {}}
       />
 

[Survived] BooleanLiteral
roberto/teste-cit/src/App.js:61:32
         }}
         onSave={(schedule) => {
           handleSaveSchedule(schedule);
-          setOpenModalSchedule(false);
+          setOpenModalSchedule(true);
         }}
       />

[Killed] BooleanLiteral
roberto/teste-cit/src/App.js:69:21
         <FullCalendar
           locale="pt-br"
           plugins={[timeGridPlugin, interactionPlugin]}
-          weekends={false}
+          weekends={true}
           events={events}
           dateClick={(arg) => handleDateClick(arg)}

[Survived] ArrowFunction
roberto/teste-cit/src/App.js:71:22
           plugins={[timeGridPlugin, interactionPlugin]}
           weekends={false}
           events={events}
-          dateClick={(arg) => handleDateClick(arg)}
+          dateClick={() => undefined}
           eventClick={(arg) => handleEventClick(arg)}
         />

[Survived] ArrowFunction
roberto/teste-cit/src/App.js:72:23
           weekends={false}
           events={events}
           dateClick={(arg) => handleDateClick(arg)}
-          eventClick={(arg) => handleEventClick(arg)}
+          eventClick={() => undefined}
         />
       </Container>
