[Killed] BlockStatement
teste-cit/src/actions/useExecuteSchedule.js:4:46
 import { useState, useCallback } from "react";
 import { schedule } from "../services/job";
 
-export default function useExecuteSchedule() {
-  const [listResult, setListResult] = useState();
-
-  const handleExecuteSchedule = useCallback((item) => {
-    const result = schedule([...item.jobs], item.start, item.end);
-
-    setListResult(result);
-  }, []);
-
-  return {
-    handleExecuteSchedule,
-    listResult,
-    clearResult: () => setListResult(),
-  };
-}
+export default function useExecuteSchedule() {}
 

[Killed] BlockStatement
teste-cit/src/actions/useExecuteSchedule.js:7:55
 export default function useExecuteSchedule() {
   const [listResult, setListResult] = useState();
 
-  const handleExecuteSchedule = useCallback((item) => {
-    const result = schedule([...item.jobs], item.start, item.end);
-
-    setListResult(result);
-  }, []);
+  const handleExecuteSchedule = useCallback((item) => {}, []);
 
   return {

[Killed] ArrayDeclaration
teste-cit/src/actions/useExecuteSchedule.js:8:29
   const [listResult, setListResult] = useState();
 
   const handleExecuteSchedule = useCallback((item) => {
-    const result = schedule([...item.jobs], item.start, item.end);
+    const result = schedule([], item.start, item.end);
 
     setListResult(result);

[Survived] ArrayDeclaration
teste-cit/src/actions/useExecuteSchedule.js:11:6
     const result = schedule([...item.jobs], item.start, item.end);
 
     setListResult(result);
-  }, []);
+  }, ["Stryker was here"]);
 
   return {

[Killed] ObjectLiteral
teste-cit/src/actions/useExecuteSchedule.js:13:10
     setListResult(result);
   }, []);
 
-  return {
-    handleExecuteSchedule,
-    listResult,
-    clearResult: () => setListResult(),
-  };
+  return {};
 }
 

[Killed] ArrowFunction
teste-cit/src/actions/useExecuteSchedule.js:16:18
   return {
     handleExecuteSchedule,
     listResult,
-    clearResult: () => setListResult(),
+    clearResult: () => undefined,
   };
 }
