[Survived] BlockStatement
teste-cit/src/actions/useFormSchedule.js:8:19
 export default function useFormSchedule(defaultValue) {
   const [form, setForm] = useState();
 
-  useEffect(() => {
-    setForm(defaultValue);
-  }, [defaultValue]);
+  useEffect(() => {}, [defaultValue]);
 
   const onChange = useCallback((prop, v) => {

[Survived] BlockStatement
teste-cit/src/actions/useFormSchedule.js:12:45
     setForm(defaultValue);
   }, [defaultValue]);
 
-  const onChange = useCallback((prop, v) => {
-    setForm((prev) => ({
-      ...prev,
-      [prop]: v,
-    }));
-  }, []);
+  const onChange = useCallback((prop, v) => {}, []);
 
   const handleSaveJobs = useCallback(

[Survived] ArrowFunction
teste-cit/src/actions/useFormSchedule.js:13:13
   }, [defaultValue]);
 
   const onChange = useCallback((prop, v) => {
-    setForm((prev) => ({
-      ...prev,
-      [prop]: v,
-    }));
+    setForm(() => undefined);
   }, []);
 

[Survived] BlockStatement
teste-cit/src/actions/useFormSchedule.js:20:18
   }, []);
 
   const handleSaveJobs = useCallback(
-    (jobSave) => {
-      const jobs = form?.jobs ?? [];
-
-      if (!jobSave.id) {
-        onChange("jobs", [...jobs, { id: jobs.length + 1, ...jobSave }]);
-        return;
-      }
-
-      const newJobs = form.jobs.map((item) => {
-        if (item.id === jobSave.id) {
-          return jobSave;
-        }
-
-        return item;
-      });
-
-      onChange("jobs", newJobs);
-    },
+    (jobSave) => {},
     [form, onChange]
   );

[Survived] ArrayDeclaration
teste-cit/src/actions/useFormSchedule.js:21:34
 
   const handleSaveJobs = useCallback(
     (jobSave) => {
-      const jobs = form?.jobs ?? [];
+      const jobs = form?.jobs ?? ["Stryker was here"];
 
       if (!jobSave.id) {

[Survived] BlockStatement
teste-cit/src/actions/useFormSchedule.js:23:24
     (jobSave) => {
       const jobs = form?.jobs ?? [];
 
-      if (!jobSave.id) {
-        onChange("jobs", [...jobs, { id: jobs.length + 1, ...jobSave }]);
-        return;
-      }
+      if (!jobSave.id) {}
 
       const newJobs = form.jobs.map((item) => {

[Survived] BooleanLiteral
teste-cit/src/actions/useFormSchedule.js:23:11
     (jobSave) => {
       const jobs = form?.jobs ?? [];
 
-      if (!jobSave.id) {
+      if (jobSave.id) {
         onChange("jobs", [...jobs, { id: jobs.length + 1, ...jobSave }]);
         return;

[Survived] ArithmeticOperator
teste-cit/src/actions/useFormSchedule.js:24:42
       const jobs = form?.jobs ?? [];
 
       if (!jobSave.id) {
-        onChange("jobs", [...jobs, { id: jobs.length + 1, ...jobSave }]);
+        onChange("jobs", [...jobs, { id: jobs.length - 1, ...jobSave }]);
         return;
       }

[Survived] StringLiteral
teste-cit/src/actions/useFormSchedule.js:24:18
       const jobs = form?.jobs ?? [];
 
       if (!jobSave.id) {
-        onChange("jobs", [...jobs, { id: jobs.length + 1, ...jobSave }]);
+        onChange("", [...jobs, { id: jobs.length + 1, ...jobSave }]);
         return;
       }

[Survived] BlockStatement
teste-cit/src/actions/useFormSchedule.js:28:47
         return;
       }
 
-      const newJobs = form.jobs.map((item) => {
-        if (item.id === jobSave.id) {
-          return jobSave;
-        }
-
-        return item;
-      });
+      const newJobs = form.jobs.map((item) => {});
 
       onChange("jobs", newJobs);

[Survived] BlockStatement
teste-cit/src/actions/useFormSchedule.js:29:37
       }
 
       const newJobs = form.jobs.map((item) => {
-        if (item.id === jobSave.id) {
-          return jobSave;
-        }
+        if (item.id === jobSave.id) {}
 
         return item;

[Survived] ConditionalExpression
teste-cit/src/actions/useFormSchedule.js:29:13
       }
 
       const newJobs = form.jobs.map((item) => {
-        if (item.id === jobSave.id) {
+        if (true) {
           return jobSave;
         }

[Survived] BlockStatement
teste-cit/src/actions/useFormSchedule.js:41:48
     [form, onChange]
   );
 
-  const validateBeforeSave = useCallback(() => {
-    if (!form?.title) {
-      return "Informe o titulo do agendamento";
-    }
-
-    if (!form?.start) {
-      return "Informe a data de inicio do agendamento";
-    }
-
-    if (!form?.end) {
-      return "Informe a data de fim do agendamento";
-    }
-
-    if (!form.jobs?.length) {
-      return "Informe pelo menos 1 job para o agendamento";
-    }
-
-    return null;
-  }, [form]);
+  const validateBeforeSave = useCallback(() => {}, [form]);
 
   return {

[Survived] ConditionalExpression
teste-cit/src/actions/useFormSchedule.js:42:9
   );
 
   const validateBeforeSave = useCallback(() => {
-    if (!form?.title) {
+    if (false) {
       return "Informe o titulo do agendamento";
     }

[Survived] BooleanLiteral
teste-cit/src/actions/useFormSchedule.js:42:9
   );
 
   const validateBeforeSave = useCallback(() => {
-    if (!form?.title) {
+    if (form?.title) {
       return "Informe o titulo do agendamento";
     }

[Survived] ConditionalExpression
teste-cit/src/actions/useFormSchedule.js:46:9
       return "Informe o titulo do agendamento";
     }
 
-    if (!form?.start) {
+    if (true) {
       return "Informe a data de inicio do agendamento";
     }

[Survived] BooleanLiteral
teste-cit/src/actions/useFormSchedule.js:46:9
       return "Informe o titulo do agendamento";
     }
 
-    if (!form?.start) {
+    if (form?.start) {
       return "Informe a data de inicio do agendamento";
     }

[Survived] StringLiteral
teste-cit/src/actions/useFormSchedule.js:47:14
     }
 
     if (!form?.start) {
-      return "Informe a data de inicio do agendamento";
+      return "";
     }
 

[Survived] ConditionalExpression
teste-cit/src/actions/useFormSchedule.js:50:9
       return "Informe a data de inicio do agendamento";
     }
 
-    if (!form?.end) {
+    if (false) {
       return "Informe a data de fim do agendamento";
     }

[Survived] ConditionalExpression
teste-cit/src/actions/useFormSchedule.js:50:9
       return "Informe a data de inicio do agendamento";
     }
 
-    if (!form?.end) {
+    if (true) {
       return "Informe a data de fim do agendamento";
     }

[Survived] BlockStatement
teste-cit/src/actions/useFormSchedule.js:54:29
       return "Informe a data de fim do agendamento";
     }
 
-    if (!form.jobs?.length) {
-      return "Informe pelo menos 1 job para o agendamento";
-    }
+    if (!form.jobs?.length) {}
 
     return null;

[Survived] ConditionalExpression
teste-cit/src/actions/useFormSchedule.js:54:9
       return "Informe a data de fim do agendamento";
     }
 
-    if (!form.jobs?.length) {
+    if (false) {
       return "Informe pelo menos 1 job para o agendamento";
     }
