[Killed] BlockStatement
teste-cit/src/actions/useSchedules.js:7:19
   const [schedules, setSchedules] = useState([]);
 
   const handleSaveSchedule = useCallback(
-    (schedule) => {
-      if (!schedule.id) {
-        schedule.id = +new Date();
-        setSchedules((prev) => [...prev, schedule]);
-
-        return;
-      }
-
-      const newSchedules = schedules.map((item) => {
-        if (item.id === schedule.id) {
-          return schedule;
-        }
-
-        return item;
-      });
-
-      setSchedules(newSchedules);
-    },
+    (schedule) => {},
     [schedules]
   );

[Killed] BlockStatement
teste-cit/src/actions/useSchedules.js:8:25
 
   const handleSaveSchedule = useCallback(
     (schedule) => {
-      if (!schedule.id) {
-        schedule.id = +new Date();
-        setSchedules((prev) => [...prev, schedule]);
-
-        return;
-      }
+      if (!schedule.id) {}
 
       const newSchedules = schedules.map((item) => {

[Killed] ConditionalExpression
teste-cit/src/actions/useSchedules.js:8:11
 
   const handleSaveSchedule = useCallback(
     (schedule) => {
-      if (!schedule.id) {
+      if (false) {
         schedule.id = +new Date();
         setSchedules((prev) => [...prev, schedule]);

[Survived] UnaryOperator
teste-cit/src/actions/useSchedules.js:9:23
   const handleSaveSchedule = useCallback(
     (schedule) => {
       if (!schedule.id) {
-        schedule.id = +new Date();
+        schedule.id = -new Date();
         setSchedules((prev) => [...prev, schedule]);
 

[Killed] ArrowFunction
teste-cit/src/actions/useSchedules.js:10:22
     (schedule) => {
       if (!schedule.id) {
         schedule.id = +new Date();
-        setSchedules((prev) => [...prev, schedule]);
+        setSchedules(() => undefined);
 
         return;

[Killed] ArrayDeclaration
teste-cit/src/actions/useSchedules.js:10:32
     (schedule) => {
       if (!schedule.id) {
         schedule.id = +new Date();
-        setSchedules((prev) => [...prev, schedule]);
+        setSchedules((prev) => []);
 
         return;

[Survived] BlockStatement
teste-cit/src/actions/useSchedules.js:15:52
         return;
       }
 
-      const newSchedules = schedules.map((item) => {
-        if (item.id === schedule.id) {
-          return schedule;
-        }
-
-        return item;
-      });
+      const newSchedules = schedules.map((item) => {});
 
       setSchedules(newSchedules);

[Survived] ConditionalExpression
teste-cit/src/actions/useSchedules.js:16:13
       }
 
       const newSchedules = schedules.map((item) => {
-        if (item.id === schedule.id) {
+        if (false) {
           return schedule;
         }

[Survived] BlockStatement
teste-cit/src/actions/useSchedules.js:16:38
       }
 
       const newSchedules = schedules.map((item) => {
-        if (item.id === schedule.id) {
-          return schedule;
-        }
+        if (item.id === schedule.id) {}
 
         return item;
