[Survived] BlockStatement
src/components/ModalJob/index.js:16:19
 function ModalJob({ open, value, onCancel, onSave }) {
   const [form, setForm] = useState();
 
-  useEffect(() => {
-    setForm(value);
-  }, [open, value]);
+  useEffect(() => {}, [open, value]);
 
   const handleClose = useCallback(() => {

[Survived] BlockStatement
src/components/ModalJob/index.js:20:41
     setForm(value);
   }, [open, value]);
 
-  const handleClose = useCallback(() => {
-    onCancel();
-  }, [onCancel]);
+  const handleClose = useCallback(() => {}, [onCancel]);
 
   const handleSave = useCallback(() => {

[Survived] ArrayDeclaration
src/components/ModalJob/index.js:22:6
 
   const handleClose = useCallback(() => {
     onCancel();
-  }, [onCancel]);
+  }, []);
 
   const handleSave = useCallback(() => {

[Survived] BlockStatement
src/components/ModalJob/index.js:24:40
     onCancel();
   }, [onCancel]);
 
-  const handleSave = useCallback(() => {
-    if (!form?.description) {
-      return Swal.fire("Aviso", "Informe o titulo do job");
-    }
-
-    if (!form?.maxExecutionDate) {
-      return Swal.fire("Aviso", "Informe a data máxima de conclusão");
-    }
-
-    if (!form?.estimatedTime) {
-      return Swal.fire("Aviso", "Informe o tempo estimado em hora");
-    }
-
-    onSave(form);
-  }, [onSave, form]);
+  const handleSave = useCallback(() => {}, [onSave, form]);
 
   const onChange = useCallback((prop, v) => {

[Survived] BooleanLiteral
src/components/ModalJob/index.js:25:9
   }, [onCancel]);
 
   const handleSave = useCallback(() => {
-    if (!form?.description) {
+    if (form?.description) {
       return Swal.fire("Aviso", "Informe o titulo do job");
     }

[Survived] ConditionalExpression
src/components/ModalJob/index.js:25:9
   }, [onCancel]);
 
   const handleSave = useCallback(() => {
-    if (!form?.description) {
+    if (false) {
       return Swal.fire("Aviso", "Informe o titulo do job");
     }

[Survived] StringLiteral
src/components/ModalJob/index.js:26:33
 
   const handleSave = useCallback(() => {
     if (!form?.description) {
-      return Swal.fire("Aviso", "Informe o titulo do job");
+      return Swal.fire("Aviso", "");
     }
 

[Survived] ConditionalExpression
src/components/ModalJob/index.js:29:9
       return Swal.fire("Aviso", "Informe o titulo do job");
     }
 
-    if (!form?.maxExecutionDate) {
+    if (true) {
       return Swal.fire("Aviso", "Informe a data máxima de conclusão");
     }

[Survived] ConditionalExpression
src/components/ModalJob/index.js:29:9
       return Swal.fire("Aviso", "Informe o titulo do job");
     }
 
-    if (!form?.maxExecutionDate) {
+    if (false) {
       return Swal.fire("Aviso", "Informe a data máxima de conclusão");
     }

[Survived] BooleanLiteral
src/components/ModalJob/index.js:33:9
       return Swal.fire("Aviso", "Informe a data máxima de conclusão");
     }
 
-    if (!form?.estimatedTime) {
+    if (form?.estimatedTime) {
       return Swal.fire("Aviso", "Informe o tempo estimado em hora");
     }

[Survived] ConditionalExpression
src/components/ModalJob/index.js:33:9
       return Swal.fire("Aviso", "Informe a data máxima de conclusão");
     }
 
-    if (!form?.estimatedTime) {
+    if (true) {
       return Swal.fire("Aviso", "Informe o tempo estimado em hora");
     }

[Survived] ArrowFunction
src/components/ModalJob/index.js:59:27
                 variant="outlined"
                 value={form?.description}
                 fullWidth
-                onChange={(ev) => onChange("description", ev.target.value)}
+                onChange={() => undefined}
               />
             </FormControl>

[Survived] ArrowFunction
src/components/ModalJob/index.js:72:27
                 value={form?.maxExecutionDate}
                 variant="outlined"
                 fullWidth
-                onChange={(ev) => onChange("maxExecutionDate", ev.target.value)}
+                onChange={() => undefined}
               />
             </FormControl>

[Survived] ArrowFunction
src/components/ModalJob/index.js:84:27
                 type="number"
                 value={form?.estimatedTime}
                 fullWidth
-                onChange={(ev) =>
-                  onChange("estimatedTime", Number(ev.target.value ?? 0))
+                onChange={() => undefined
                 }
               />
