[Killed] StringLiteral
ModalSchedule/components/CardJob/index.js:19:42
               </CardJobId>
             </Grid>
             <Grid item xs={10}>
-              <CardJobTitle data-testid={`job-title-${value.id}`}>
+              <CardJobTitle data-testid={``}>
                 {value.description}
               </CardJobTitle>
