[Killed] BooleanLiteral
src/components/ModalSchedule/index.js:34:52
     handleSaveJobs,
   } = useFormSchedule(value);
 
-  const [openModalJob, setOpenModalJob] = useState(false);
+  const [openModalJob, setOpenModalJob] = useState(true);
   const [jobSelected, setJobSelected] = useState();
 

[Survived] BlockStatement
src/components/ModalSchedule/index.js:37:19
   const [openModalJob, setOpenModalJob] = useState(false);
   const [jobSelected, setJobSelected] = useState();
 
-  useEffect(() => {
-    if (!open) {
-      clearResult();
-    }
-  }, [open, clearResult]);
+  useEffect(() => {}, [open, clearResult]);
 
   const handleClose = useCallback(() => {

[Survived] BlockStatement
src/components/ModalSchedule/index.js:38:16
   const [jobSelected, setJobSelected] = useState();
 
   useEffect(() => {
-    if (!open) {
-      clearResult();
-    }
+    if (!open) {}
   }, [open, clearResult]);
 

[Survived] ConditionalExpression
src/components/ModalSchedule/index.js:38:9
   const [jobSelected, setJobSelected] = useState();
 
   useEffect(() => {
-    if (!open) {
+    if (true) {
       clearResult();
     }

[Survived] BlockStatement
src/components/ModalSchedule/index.js:47:40
     onCancel();
   }, [onCancel]);
 
-  const handleSave = useCallback(() => {
-    const error = validateBeforeSave();
-
-    if (error) {
-      return Swal.fire("Aviso", error);
-    }
-
-    onSave(form);
-  }, [form, onSave, validateBeforeSave]);
+  const handleSave = useCallback(() => {}, [form, onSave, validateBeforeSave]);
 
   const handleAddJob = useCallback(() => {

[Survived] BlockStatement
src/components/ModalSchedule/index.js:50:16
   const handleSave = useCallback(() => {
     const error = validateBeforeSave();
 
-    if (error) {
-      return Swal.fire("Aviso", error);
-    }
+    if (error) {}
 
     onSave(form);

[Survived] BlockStatement
src/components/ModalSchedule/index.js:57:42
     onSave(form);
   }, [form, onSave, validateBeforeSave]);
 
-  const handleAddJob = useCallback(() => {
-    setJobSelected();
-    setOpenModalJob(true);
-  }, []);
+  const handleAddJob = useCallback(() => {}, []);
 
   const handleClickJob = useCallback((v) => {

[Survived] BooleanLiteral
src/components/ModalSchedule/index.js:59:21
 
   const handleAddJob = useCallback(() => {
     setJobSelected();
-    setOpenModalJob(true);
+    setOpenModalJob(false);
   }, []);
 

[Survived] BlockStatement
src/components/ModalSchedule/index.js:62:45
     setOpenModalJob(true);
   }, []);
 
-  const handleClickJob = useCallback((v) => {
-    setJobSelected(v);
-    setOpenModalJob(true);
-  }, []);
+  const handleClickJob = useCallback((v) => {}, []);
 
   return (

[Survived] BooleanLiteral
src/components/ModalSchedule/index.js:64:21
 
   const handleClickJob = useCallback((v) => {
     setJobSelected(v);
-    setOpenModalJob(true);
+    setOpenModalJob(false);
   }, []);
 

[Survived] BlockStatement
src/components/ModalSchedule/index.js:72:25
       <ModalJob
         open={openModalJob}
         value={jobSelected}
-        onCancel={() => {
-          setOpenModalJob(false);
-          setJobSelected();
-        }}
+        onCancel={() => {}}
         onSave={(jobSave) => {
           setOpenModalJob(false);

[Survived] BooleanLiteral
src/components/ModalSchedule/index.js:73:27
         open={openModalJob}
         value={jobSelected}
         onCancel={() => {
-          setOpenModalJob(false);
+          setOpenModalJob(true);
           setJobSelected();
         }}

[Survived] BlockStatement
src/components/ModalSchedule/index.js:76:30
           setOpenModalJob(false);
           setJobSelected();
         }}
-        onSave={(jobSave) => {
-          setOpenModalJob(false);
-          setJobSelected();
-          handleSaveJobs(jobSave);
-        }}
+        onSave={(jobSave) => {}}
       />
 

[Survived] BooleanLiteral
src/components/ModalSchedule/index.js:77:27
           setJobSelected();
         }}
         onSave={(jobSave) => {
-          setOpenModalJob(false);
+          setOpenModalJob(true);
           setJobSelected();
           handleSaveJobs(jobSave);

[Survived] ArrowFunction
src/components/ModalSchedule/index.js:94:29
                   variant="outlined"
                   value={form?.title}
                   fullWidth
-                  onChange={(ev) => onChange("title", ev.target.value)}
+                  onChange={() => undefined}
                 />
               </FormControl>

[Survived] ObjectLiteral
src/components/ModalSchedule/index.js:105:31
                   label="Data de inicio da Janela"
                   type="datetime-local"
                   value={form?.start}
-                  inputProps={{
-                    max: form?.end,
-                  }}
+                  inputProps={{}}
                   variant="outlined"
                   fullWidth

[Survived] ArrowFunction
src/components/ModalSchedule/index.js:110:29
                   }}
                   variant="outlined"
                   fullWidth
-                  onChange={(ev) => onChange("start", ev.target.value)}
+                  onChange={() => undefined}
                 />
               </FormControl>

[Survived] ArrowFunction
src/components/ModalSchedule/index.js:126:29
                   inputProps={{
                     min: form?.start,
                   }}
-                  onChange={(ev) => onChange("end", ev.target.value)}
+                  onChange={() => undefined}
                 />
               </FormControl>

[Survived] StringLiteral
src/components/ModalSchedule/index.js:126:46
                   inputProps={{
                     min: form?.start,
                   }}
-                  onChange={(ev) => onChange("end", ev.target.value)}
+                  onChange={(ev) => onChange("", ev.target.value)}
                 />
               </FormControl>

[Survived] ArrowFunction
src/components/ModalSchedule/index.js:140:32
                 <Grid item sm={9} xs={6}>
                   <div style={{ float: "right", marginTop: 10 }}>
                     <Button
-                      onClick={() => handleAddJob()}
+                      onClick={() => undefined}
                       color="primary"
                       variant="outlined"

[Survived] ArrowFunction
src/components/ModalSchedule/index.js:152:32
             </Grid>
 
             <Grid item xs={12}>
-              {form?.jobs?.map((job, key) => (
-                <CardJob
-                  key={key}
-                  value={job}
-                  onClick={() => handleClickJob(job)}
-                />
-              ))}
+              {form?.jobs?.map(() => undefined)}
             </Grid>
 

[Survived] ArrowFunction
src/components/ModalSchedule/index.js:156:28
                 <CardJob
                   key={key}
                   value={job}
-                  onClick={() => handleClickJob(job)}
+                  onClick={() => undefined}
                 />
               ))}

[Survived] ArrowFunction
src/components/ModalSchedule/index.js:164:28
             {form?.jobs?.length ? (
               <ContainerButtonExecute>
                 <Button
-                  onClick={() => handleExecuteSchedule(form)}
+                  onClick={() => undefined}
                   color="secondary"
                   variant="outlined"
