[Killed] StringLiteral
ModalSchedule/components/CardJob/styles.js:18:39
   border-radius: 8px;
 `;
 
-export const CardJobTitle = styled.div`
-  font-size: 16px;
-  margin-bottom: 8px;
-`;
+export const CardJobTitle = styled.div``;
 
 export const CardJobLabel = styled.span`
