[Survived] StringLiteral
src/components/ModalSchedule/styles.js:3:49
 import styled from "styled-components";
 
-export const ContainerButtonExecute = styled.div`
-  text-align: center;
-  margin-bottom: 32px;
-  width: 100%;
-`;
+export const ContainerButtonExecute = styled.div``;
 
 export const ContainerResultSchedule = styled.div`
