[Killed] ConditionalExpression
teste-cit/src/services/job.js:23:9
       endSchedule
     );
 
-    if (isValidJob === false) {
+    if (true) {
       continue;
     }

[Killed] EqualityOperator
teste-cit/src/services/job.js:23:9
       endSchedule
     );
 
-    if (isValidJob === false) {
+    if (isValidJob !== false) {
       continue;
     }

[Killed] EqualityOperator
teste-cit/src/services/job.js:27:9
       continue;
     }
 
-    if (batchs.length === 0) {
+    if (batchs.length !== 0) {
       batchs.push(batch);
     }

[Killed] BlockStatement
teste-cit/src/services/job.js:27:30
       continue;
     }
 
-    if (batchs.length === 0) {
-      batchs.push(batch);
-    }
+    if (batchs.length === 0) {}
 
     const batchEstimated = sumEstimatedJobs(batch);

[Killed] ArithmeticOperator
teste-cit/src/services/job.js:33:9
 
     const batchEstimated = sumEstimatedJobs(batch);
 
-    if (batchEstimated + estimatedTime > MAX_HOUR_EXECUTION) {
+    if (batchEstimated - estimatedTime > MAX_HOUR_EXECUTION) {
       batch = [];
       batchs.push(batch);

[Killed] ConditionalExpression
teste-cit/src/services/job.js:33:9
 
     const batchEstimated = sumEstimatedJobs(batch);
 
-    if (batchEstimated + estimatedTime > MAX_HOUR_EXECUTION) {
+    if (false) {
       batch = [];
       batchs.push(batch);

[Killed] StringLiteral
teste-cit/src/services/job.js:38:54
       batchs.push(batch);
     }
 
-    nextStartDate = nextStartDate.add(estimatedTime, "hour");
+    nextStartDate = nextStartDate.add(estimatedTime, "");
 
     batch.push(job);

[Killed] ArrowFunction
teste-cit/src/services/job.js:43:50
     batch.push(job);
   }
 
-  const result = batchs.map((batch) => batch.map((job) => job.id));
+  const result = batchs.map((batch) => batch.map(() => undefined));
 
   return result;

[Killed] ArrowFunction
teste-cit/src/services/job.js:43:29
     batch.push(job);
   }
 
-  const result = batchs.map((batch) => batch.map((job) => job.id));
+  const result = batchs.map(() => undefined);
 
   return result;

[Killed] BlockStatement
teste-cit/src/services/job.js:48:40
   return result;
 }
 
-export function sumEstimatedJobs(jobs) {
-  const result = jobs.reduce((prev, item) => prev + item.estimatedTime, 0);
-
-  return result;
-}
+export function sumEstimatedJobs(jobs) {}
 
 export function checkValidJob(

[Killed] ArithmeticOperator
teste-cit/src/services/job.js:49:46
 }
 
 export function sumEstimatedJobs(jobs) {
-  const result = jobs.reduce((prev, item) => prev + item.estimatedTime, 0);
+  const result = jobs.reduce((prev, item) => prev - item.estimatedTime, 0);
 
   return result;

[Killed] ArrowFunction
teste-cit/src/services/job.js:49:30
 }
 
 export function sumEstimatedJobs(jobs) {
-  const result = jobs.reduce((prev, item) => prev + item.estimatedTime, 0);
+  const result = jobs.reduce(() => undefined, 0);
 
   return result;

[Killed] BlockStatement
teste-cit/src/services/job.js:59:3
   estimatedTime,
   nextStartDate,
   maxEndSchedule
-) {
-  const maxStartDate = moment(maxExecutionDate).subtract(estimatedTime, "hour");
-
-  if (checkAvailabilityStartJob(maxStartDate, nextStartDate) === false) {
-    return false;
-  }
-
-  if (checkExceedEstimatedJob(estimatedTime)) {
-    return false;
-  }
-
-  if (moment(nextStartDate).isAfter(maxEndSchedule)) {
-    return false;
-  }
-
-  if (
-    moment(nextStartDate).add(estimatedTime, "hour").isAfter(maxEndSchedule)
-  ) {
-    return false;
-  }
-
-  return true;
-}
+) {}
 
 export function checkAvailabilityStartJob(startDate, nextStartDate) {

[Killed] StringLiteral
teste-cit/src/services/job.js:60:73
   nextStartDate,
   maxEndSchedule
 ) {
-  const maxStartDate = moment(maxExecutionDate).subtract(estimatedTime, "hour");
+  const maxStartDate = moment(maxExecutionDate).subtract(estimatedTime, "");
 
   if (checkAvailabilityStartJob(maxStartDate, nextStartDate) === false) {

[Killed] EqualityOperator
teste-cit/src/services/job.js:62:7
 ) {
   const maxStartDate = moment(maxExecutionDate).subtract(estimatedTime, "hour");
 
-  if (checkAvailabilityStartJob(maxStartDate, nextStartDate) === false) {
+  if (checkAvailabilityStartJob(maxStartDate, nextStartDate) !== false) {
     return false;
   }

[Killed] BlockStatement
teste-cit/src/services/job.js:62:73
 ) {
   const maxStartDate = moment(maxExecutionDate).subtract(estimatedTime, "hour");
 
-  if (checkAvailabilityStartJob(maxStartDate, nextStartDate) === false) {
-    return false;
-  }
+  if (checkAvailabilityStartJob(maxStartDate, nextStartDate) === false) {}
 
   if (checkExceedEstimatedJob(estimatedTime)) {

[Killed] BooleanLiteral
teste-cit/src/services/job.js:63:12
   const maxStartDate = moment(maxExecutionDate).subtract(estimatedTime, "hour");
 
   if (checkAvailabilityStartJob(maxStartDate, nextStartDate) === false) {
-    return false;
+    return true;
   }
 

[Killed] ConditionalExpression
teste-cit/src/services/job.js:66:7
     return false;
   }
 
-  if (checkExceedEstimatedJob(estimatedTime)) {
+  if (true) {
     return false;
   }

[Killed] ConditionalExpression
teste-cit/src/services/job.js:66:7
     return false;
   }
 
-  if (checkExceedEstimatedJob(estimatedTime)) {
+  if (false) {
     return false;
   }

[Killed] BooleanLiteral
teste-cit/src/services/job.js:67:12
   }
 
   if (checkExceedEstimatedJob(estimatedTime)) {
-    return false;
+    return true;
   }
 

[Killed] ConditionalExpression
teste-cit/src/services/job.js:70:7
     return false;
   }
 
-  if (moment(nextStartDate).isAfter(maxEndSchedule)) {
+  if (true) {
     return false;
   }

[Survived] ConditionalExpression
teste-cit/src/services/job.js:70:7
     return false;
   }
 
-  if (moment(nextStartDate).isAfter(maxEndSchedule)) {
+  if (false) {
     return false;
   }

[Survived] BooleanLiteral
teste-cit/src/services/job.js:71:12
   }
 
   if (moment(nextStartDate).isAfter(maxEndSchedule)) {
-    return false;
+    return true;
   }
 

[Killed] ConditionalExpression
teste-cit/src/services/job.js:75:5
   }
 
   if (
-    moment(nextStartDate).add(estimatedTime, "hour").isAfter(maxEndSchedule)
+    false
   ) {
     return false;

[Killed] ConditionalExpression
teste-cit/src/services/job.js:75:5
   }
 
   if (
-    moment(nextStartDate).add(estimatedTime, "hour").isAfter(maxEndSchedule)
+    true
   ) {
     return false;

[Killed] BlockStatement
teste-cit/src/services/job.js:76:5
 
   if (
     moment(nextStartDate).add(estimatedTime, "hour").isAfter(maxEndSchedule)
-  ) {
-    return false;
-  }
+  ) {}
 
   return true;

[Killed] BlockStatement
teste-cit/src/services/job.js:83:69
   return true;
 }
 
-export function checkAvailabilityStartJob(startDate, nextStartDate) {
-  const result = moment(startDate).isSameOrAfter(nextStartDate);
-
-  return result;
-}
+export function checkAvailabilityStartJob(startDate, nextStartDate) {}
 
 export function checkExceedEstimatedJob(estimatedTime) {

[Killed] BlockStatement
teste-cit/src/services/job.js:89:56
   return result;
 }
 
-export function checkExceedEstimatedJob(estimatedTime) {
-  const result = estimatedTime > MAX_HOUR_EXECUTION;
-
-  return result;
-}
+export function checkExceedEstimatedJob(estimatedTime) {}
 
 export function sortedJobsByDate(jobs) {

[Killed] ConditionalExpression
teste-cit/src/services/job.js:90:18
 }
 
 export function checkExceedEstimatedJob(estimatedTime) {
-  const result = estimatedTime > MAX_HOUR_EXECUTION;
+  const result = true;
 
   return result;

[Killed] EqualityOperator
teste-cit/src/services/job.js:90:18
 }
 
 export function checkExceedEstimatedJob(estimatedTime) {
-  const result = estimatedTime > MAX_HOUR_EXECUTION;
+  const result = estimatedTime <= MAX_HOUR_EXECUTION;
 
   return result;

[Killed] BlockStatement
teste-cit/src/services/job.js:95:40
   return result;
 }
 
-export function sortedJobsByDate(jobs) {
-  return jobs.sort((a, b) => {
-    const condition = moment(a.maxExecutionDate).isAfter(b.maxExecutionDate)
-      ? 1
-      : -1;
-
-    return condition;
-  });
-}
+export function sortedJobsByDate(jobs) {}
 

[Killed] BlockStatement
teste-cit/src/services/job.js:96:30
 }
 
 export function sortedJobsByDate(jobs) {
-  return jobs.sort((a, b) => {
-    const condition = moment(a.maxExecutionDate).isAfter(b.maxExecutionDate)
-      ? 1
-      : -1;
-
-    return condition;
-  });
+  return jobs.sort((a, b) => {});
 }
 

[Killed] UnaryOperator
teste-cit/src/services/job.js:99:9
   return jobs.sort((a, b) => {
     const condition = moment(a.maxExecutionDate).isAfter(b.maxExecutionDate)
       ? 1
-      : -1;
+      : +1;
 
     return condition;
