[Survived] BlockStatement
roberto/teste-cit/src/setupTests.js:7:33
 // learn more: https://github.com/testing-library/jest-dom
 import "@testing-library/jest-dom";
 
-const localStorageMock = (() => {
-  let store = {};
-  return {
-    getItem: (key) => {
-      return store[key];
-    },
-    setItem: (key, value) => {
-      store[key] = value.toString();
-    },
-    clear: () => {
-      store = {};
-    },
-    removeItem: (key) => {
-      delete store[key];
-    },
-  };
-})();
+const localStorageMock = (() => {})();
 
 global.localStorage = localStorageMock;

[Survived] BlockStatement
roberto/teste-cit/src/setupTests.js:10:23
 const localStorageMock = (() => {
   let store = {};
   return {
-    getItem: (key) => {
-      return store[key];
-    },
+    getItem: (key) => {},
     setItem: (key, value) => {
       store[key] = value.toString();

[Survived] BlockStatement
roberto/teste-cit/src/setupTests.js:13:30
     getItem: (key) => {
       return store[key];
     },
-    setItem: (key, value) => {
-      store[key] = value.toString();
-    },
+    setItem: (key, value) => {},
     clear: () => {
       store = {};

[Survived] BlockStatement
roberto/teste-cit/src/setupTests.js:16:18
     setItem: (key, value) => {
       store[key] = value.toString();
     },
-    clear: () => {
-      store = {};
-    },
+    clear: () => {},
     removeItem: (key) => {
       delete store[key];

[Survived] BlockStatement
roberto/teste-cit/src/setupTests.js:19:26
     clear: () => {
       store = {};
     },
-    removeItem: (key) => {
-      delete store[key];
-    },
+    removeItem: (key) => {},
   };
 })();
